% Ορισμός των τμημάτων της συνάρτησης
f1 = @(x) 0*x;     % Για x < 0
f2 = @(x) sqrt(x);  % Για x >= 0

% Καθορισμός των διαστημάτων για κάθε τμήμα
x1 = -5:0.01:-0.01; % Διάστημα για f1
x2 = 0:0.01:5;      % Διάστημα για f2

% Υπολογισμός των τιμών της συνάρτησης στα αντίστοιχα διαστήματα
y1 = f1(x1);
y2 = f2(x2);

% Σχεδίαση της συνάρτησης
figure;             % Δημιουργία νέου γραφήματος
hold on;            % Διατήρηση του τρέχοντος γραφήματος

plot(x1, y1, 'b', 'DisplayName', 'x^2 για x < 0');
plot(x2, y2, 'r', 'DisplayName', '\surd{x} για x \geq 0');

title('Διπλά Διακλαδισμένη Συνάρτηση');
xlabel('x');
ylabel('f(x)');
legend('show');     % Εμφάνιση θρύλου
grid on;            % Προσθήκη πλέγματος

hold off;           % Απελευθέρωση του τρέχοντος γραφήματος